try:
    день = int(input("Введите день рождения (1-31): "))
    месяц = int(input("Введите месяц рождения (1-12): "))
except ValueError:
    print("Ошибка: пожалуйста, вводите только целые числа без запятых и точек.")
    exit()

знак = None

if  (месяц == 3 and день >= 21) or (месяц == 4 and день <= 20):
    знак = "Овен"
elif (месяц == 4 and день >= 21) or (месяц == 5 and день <= 21):
    знак = "Телец"
elif (месяц == 5 and день >= 22) or (месяц == 6 and день <= 21):
    знак = "Близнецы"
elif (месяц == 6 and день >= 22) or (месяц == 7 and день <= 22):
    знак = "Рак"
elif (месяц == 7 and день >= 23) or (месяц == 8 and день <= 21):
    знак = "Лев"
elif (месяц == 8 and день >= 22) or (месяц == 9 and день <= 23):
    знак = "Дева"
elif (месяц == 9 and день >= 24) or (месяц == 10 and день <= 23):
    знак = "Весы"
elif (месяц == 10 and день >= 24) or (месяц == 11 and день <= 22):
    знак = "Скорпион"
elif (месяц == 11 and день >= 23) or (месяц == 12 and день <= 22):
    знак = "Стрелец"
elif (месяц == 12 and день >= 23) or (месяц == 1 and день <= 20):
    знак = "Козерог"
elif (месяц == 1 and день >= 21) or (месяц == 2 and день <= 19):
    знак = "Водолей"
elif (месяц == 2 and день >= 20) or (месяц == 3 and день <= 20):
    знак = "Рыбы"

if знак:
    print("Ваш знак зодиака:", знак)
else:import calendar

print("Неверная дата")







