#Логический тип данных. Операторы: условные, сравнения, логические.

time = input('enter time: ').lower()

if time == 'morning' or time == 'утро':
     print('good morning')
elif time == 'day' or time == 'день':
     print('good afternoon')
elif time == 'evening' or time == 'вечер':
     print('good evening')
else:
     print('hello')

# Условие создать, право выбора. Условные операторы
#"""оператры сравнения"""
#Результат проверки and два вида должны быть правильными
# Мы используем and, or, not когда нужно что-то сравнить. Когда мы используем and, то он проверяет что бы все было точьв точь.
# Когда используем or, то он отвечает за одно правильное движени.
#Когда же используем нот, то он переворачивает значение, то есть если пишем привет, то он перевернет значение и будет досвидания.






